institutes = [
    "ИЯЭиП",
    "Политехнический институт",
    "Морской институт",
    "ИРиИБ",
    "ГПИ",
    "ИФЭиУ",
    "ИИТУТС",
    "Юридический институт",
    "ИОНиМО",
    "ИНТИ",
    "ИРГ",
    "ИДП",
]

groups = [
    [],
    [],
    [],
    [],
    [],
    [],
    # ИИТУТС
    [
        ["ис/б-21-1-о", "ис/б-21-2-о", "ис/б-21-3-о", "пи/б-21-1-о", "ивт/б-21-1-о",
         "ивт/б-21-2-о", "ивт/б-21-3-о", "пин/б-21-1-о", "утс/б-21-11-о", "утс/б-21-12-о"],
        ["ис/б-20-1-о", "ис/б-20-2-о", "ис/б-20-3-о", "пи/б-20-1-о", "ивт/б-20-1-о",
         "ивт/б-20-2-о", "пин/б-20-1-о", "утс/б-20-1-о", "утс/б-20-2-о"],
        ["ис/б-19-1-о", "ис/б-19-2-о", "пи/б-19-1-о", "ивт/б-19-1-о", "ивт/б-19-2-о",
         "пин/б-19-1-о", "утс/б-19-1-о", "утс/б-19-2-о"],
        ["ис/б-18-1-о", "ис/б-18-2-о", "пи/б-18-1-о", "утс/б-18-1-о", "ивт/б-18-1-о", "ивт/б-18-1-о"],
        ["ис/м-21-1-о", "пи/м-21-1-о", "утс/м-21-1-о", "мир/м-21-1-о", "ивт/м-21-1-о", "пин/м-21-1-о"],
        ["ис/м-20-1-о", "пи/м-20-1-о", "утс/м-20-1-о", "мир/м-20-1-о", "ивт/м-20-1-о", "пин/м-20-1-о"]
    ],
    [],
    [],
    [],
    [],
    [],
]

phrases = [
    "*«Дроби детям не игрушка»*\n© Ольшанская И. В.",
    "*«Я никогда не ошибаюсь»*\n© Силаев Валентин",
    # "*«Базилик»*\n© Мочалин Никита",
    # "*«Ромашка»*\n© Яресько Юлия",
    "*«В универе я научился вставать в 5:40»*\n© Вадим Контарев",
    "*«В универе я разучился спать»*\n© Иван Церакиди",
    "*«Выпил энергетик...\n\n\nСтал зевать энергичнее»*\n© Иван Церакиди",
]